Revit 2027 API
ScheduleFilter.SetValue Method
Overload List
Name | Description
SetValue(Double) |  Set the filter value to a double.
SetValue(ElementId) |  Set the filter value to an ElementId.
SetValue(Int32) |  Set the filter value to an integer.
SetValue(String) |  Set the filter value to a string.
Top
See Also
Reference
ScheduleFilter Class
Autodesk.Revit.DB Namespace